Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/edc/ATSAMV71Q21.PIC
      <edc:SFRDef edc:_addr="0x400003D4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO117" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400003D8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO118" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400003DC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO119" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400003E0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO120" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400003E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO121" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400003E8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO122" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400003EC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO123" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400003F0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO124" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400003F4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO125" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400003F8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO126" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400003FC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO127" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000400" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO128" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000404" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO129" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000408" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO130" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
