Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/edc/ATSAMV71Q21.PIC
      <edc:SFRDef edc:_addr="0x400100C8" edc:access="-----------------------------www" edc:cname="TC1_QIER" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="TC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:desc="Direction Change" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:desc="Quadrature Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400100CC" edc:access="-----------------------------www" edc:cname="TC1_QIDR" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="TC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:desc="Direction Change" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:desc="Quadrature Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400100D0" edc:access="-----------------------------rrr" edc:cname="TC1_QIMR" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="TC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:desc="Direction Change" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:desc="Quadrature Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400100D4" edc:access="-----------------------r-----rrr" edc:cname="TC1_QISR" edc:impl="0x107" edc:nzwidth="0x20" ltx:memberofperipheral="TC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:desc="Direction Change" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:desc="Quadrature Error" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Direction" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400100D8" edc:access="------------------------------nn" edc:cname="TC1_FMR" edc:impl="0x3" edc:nzwidth="0x20" ltx:memberofperipheral="TC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="ENCF0" edc:desc="Enable Compare Fault Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENCF1" edc:desc="Enable Compare Fault Channel 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400100DC" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x400100E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="TC1_WPMR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="TC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x54494D"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400100E8" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x400100FC" edc:access="-------------rrr----rrrrrrrrrrrr" edc:cname="TC1_VER" edc:impl="0x70FFF" edc:nzwidth="0x20" ltx:memberofperipheral="TC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
            <edc:SFRFieldDef edc:cname="VERSION" edc:desc="Version of the Hardware Module" edc:nzwidth="0xC"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MFN" edc:desc="Metal Fix Number" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40010100" edc:offset="0x3F00"/>
      <edc:SFRDef edc:_addr="0x40014000" edc:access="-----------------------------www" edc:cname="TC_CHANNELTC2_CCR" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="CLKEN" edc:desc="Counter Clock Enable Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKDIS" edc:desc="Counter Clock Disable Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRG" edc:desc="Software Trigger Command" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40014004" edc:access="---------nnnnnnnnn---nnnnnnnnnnn" edc:cname="TC_CHANNELTC2_CMR" edc:impl="0x7FC7FF" edc:nzwidth="0x20" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="TCCLKS" edc:desc="Clock Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="TIMER_CLOCK1" edc:desc="Clock selected: internal PCK6 clock signal (from PMC)" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIMER_CLOCK2" edc:desc="Clock selected: internal MCK/8 clock signal (from PMC)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="TIMER_CLOCK3" edc:desc="Clock selected: internal MCK/32 clock signal (from PMC)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIMER_CLOCK4" edc:desc="Clock selected: internal MCK/128 clock signal (from PMC)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="TIMER_CLOCK5" edc:desc="Clock selected: internal SLCK clock signal (from PMC)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="XC0" edc:desc="Clock selected: XC0" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="XC1" edc:desc="Clock selected: XC1" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="XC2" edc:desc="Clock selected: XC2" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CLKI" edc:desc="Clock Invert" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BURST" edc:desc="Burst Signal Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="The clock is not gated by an external signal." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="XC0" edc:desc="XC0 is ANDed with the selected clock." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="XC1" edc:desc="XC1 is ANDed with the selected clock." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="XC2" edc:desc="XC2 is ANDed with the selected clock." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LDBSTOP" edc:desc="Counter Clock Stopped with RB Loading" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDBDIS" edc:desc="Counter Clock Disable with RB Loading" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ETRGEDG" edc:desc="External Trigger Edge Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="The clock is not gated by an external signal." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Rising edge" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Falling edge" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="EDGE" edc:desc="Each edge" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ABETRG" edc:desc="TIOAx or TIOBx External Trigger Selection" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CPCTRG" edc:desc="RC Compare Trigger Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAVE" edc:desc="Waveform Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDRA" edc:desc="RA Loading Edge Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="None" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Rising edge of TIOAx" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Falling edge of TIOAx" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="EDGE" edc:desc="Each edge of TIOAx" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LDRB" edc:desc="RB Loading Edge Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="None" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Rising edge of TIOAx" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Falling edge of TIOAx" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="EDGE" edc:desc="Each edge of TIOAx" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SBSMPLR" edc:desc="Loading Edge Subsampling Ratio" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="ONE" edc:desc="Load a Capture Register each selected edge" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HALF" edc:desc="Load a Capture Register every 2 selected edges" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FOURTH" edc:desc="Load a Capture Register every 4 selected edges" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="EIGHTH" edc:desc="Load a Capture Register every 8 selected edges" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="SIXTEENTH" edc:desc="Load a Capture Register every 16 selected edges" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40014008" edc:access="------------------------------nn" edc:cname="TC_CHANNELTC2_SMMR" edc:impl="0x3" edc:nzwidth="0x20" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="GCEN" edc:desc="Gray Count Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DOWN" edc:desc="Down Count" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4001400C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="TC_CHANNELTC2_RAB" edc:nzwidth="0x20" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="RAB" edc:desc="Register A or Register B" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40014010" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="TC_CHANNELTC2_CV" edc:nzwidth="0x20" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="CV" edc:desc="Counter Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
