Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/edc/ATSAMV71Q21.PIC
      <edc:SFRDef edc:_addr="0x4004C054" edc:access="----------------------------nnnn" edc:cname="ISI_DMA_C_CTRL" edc:impl="0xF" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="C_FETCH" edc:desc="Descriptor Fetch Control Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_WB" edc:desc="Descriptor Writeback Control Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_IEN" edc:desc="Transfer Done Flag Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_DONE" edc:desc="Codec Transfer Done" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C058" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="ISI_DMA_C_DSCR" edc:impl="0xFFFFFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="C_DSCR" edc:desc="Codec Descriptor Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4004C05C" edc:offset="0x88"/>
      <edc:SFRDef edc:_addr="0x4004C0E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="ISI_WPMR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key Password" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x495349"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C0E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="ISI_WPSR" edc:impl="0xFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4004C0EC" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x4004C0FC" edc:access="-------------rrr----rrrrrrrrrrrr" edc:cname="ISI_VERSION" edc:impl="0x70FFF" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="VERSION" edc:desc="Version of the Hardware Module" edc:nzwidth="0xC"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MFN" edc:desc="Metal Fix Number" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4004C100" edc:offset="0x3F00"/>
      <edc:SFRDef edc:_addr="0x40050000" edc:access="-------------nnnn--nnnnnnnnnnnn-" edc:cname="GMAC_NCR" edc:impl="0x79FFE" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LBL" edc:desc="Loop Back Local" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="Receive Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="Transmit Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MPE" edc:desc="Management Port Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLRSTAT" edc:desc="Clear Statistics Registers" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INCSTAT" edc:desc="Increment Statistics Registers" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WESTAT" edc:desc="Write Enable for Statistics Registers" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BP" edc:desc="Back pressure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSTART" edc:desc="Start Transmission" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="THALT" edc:desc="Transmit Halt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXPF" edc:desc="Transmit Pause Frame" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXZQPF" edc:desc="Transmit Zero Quantum Pause Frame" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SRTSM" edc:desc="Store Receive Time Stamp to Memory" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENPBPR" edc:desc="Enable PFC Priority-based Pause Reception" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXPBPF" edc:desc="Transmit PFC Priority-based Pause Frame" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FNP" edc:desc="Flush Next Packet" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050004" edc:access="-nnn-nnnnnnnnnnnnnnn---nnnnnnnnn" edc:cname="GMAC_NCFGR" edc:impl="0x77FFF1FF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="SPD" edc:desc="Speed" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FD" edc:desc="Full Duplex" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DNVLAN" edc:desc="Discard Non-VLAN FRAMES" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="JFRAME" edc:desc="Jumbo Frame Size" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAF" edc:desc="Copy All Frames" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NBC" edc:desc="No Broadcast" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MTIHEN" edc:desc="Multicast Hash Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNIHEN" edc:desc="Unicast Hash Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MAXFS" edc:desc="1536 Maximum Frame Size" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RTY" edc:desc="Retry Test" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN" edc:desc="Pause Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFO" edc:desc="Receive Buffer Offset" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="LFERD" edc:desc="Length Field Error Frame Discard" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RFCS" edc:desc="Remove FCS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLK" edc:desc="MDC CLock Division" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="MCK_8" edc:desc="MCK divided by 8 (MCK up to 20 MHz)" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MCK_16" edc:desc="MCK divided by 16 (MCK up to 40 MHz)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MCK_32" edc:desc="MCK divided by 32 (MCK up to 80 MHz)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MCK_48" edc:desc="MCK divided by 48 (MCK up to 120 MHz)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK_64" edc:desc="MCK divided by 64 (MCK up to 160 MHz)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="MCK_96" edc:desc="MCK divided by 96 (MCK up to 240 MHz)" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DBW" edc:desc="Data Bus Width" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="DCPF" edc:desc="Disable Copy of Pause Frames" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXCOEN" edc:desc="Receive Checksum Offload Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EFRHD" edc:desc="Enable Frames Received in Half Duplex" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IRXFCS" edc:desc="Ignore RX FCS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="IPGSEN" edc:desc="IP Stretch Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBP" edc:desc="Receive Bad Preamble" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IRXER" edc:desc="Ignore IPG GRXER" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050008" edc:access="-----------------------------rr-" edc:cname="GMAC_NSR" edc:impl="0x6" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MDIO" edc:desc="MDIO Input Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDLE" edc:desc="PHY Management Logic Idle" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005000C" edc:access="-------------------------------n" edc:cname="GMAC_UR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RMII" edc:desc="Reduced MII Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050010" edc:access="-------nnnnnnnnn----nnnnnn-nnnnn" edc:cname="GMAC_DCFGR" edc:impl="0x1FF0FDF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="FBLDO" edc:desc="Fixed Burst Length for DMA Data Operations:" edc:nzwidth="0x5">
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="00001: Always use SINGLE AHB bursts" edc:when="(field &amp; 0x1F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="INCR4" edc:desc="001xx: Attempt to use INCR4 AHB bursts (Default)" edc:when="(field &amp; 0x1F) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="INCR8" edc:desc="01xxx: Attempt to use INCR8 AHB bursts" edc:when="(field &amp; 0x1F) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="INCR16" edc:desc="1xxxx: Attempt to use INCR16 AHB bursts" edc:when="(field &amp; 0x1F) == 0x10"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ESMA" edc:desc="Endian Swap Mode Enable for Management Descriptor Accesses" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ESPA" edc:desc="Endian Swap Mode Enable for Packet Data Accesses" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBMS" edc:desc="Receiver Packet Buffer Memory Size Select" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="EIGHTH" edc:desc="4/8 Kbyte Memory Size" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="QUARTER" edc:desc="4/4 Kbytes Memory Size" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="HALF" edc:desc="4/2 Kbytes Memory Size" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="FULL" edc:desc="4 Kbytes Memory Size" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TXPBMS" edc:desc="Transmitter Packet Buffer Memory Size Select" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCOEN" edc:desc="Transmitter Checksum Generation Offload Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DRBS" edc:desc="DMA Receive Buffer Size" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DDRP" edc:desc="DMA Discard Receive Packets" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050014" edc:access="-----------------------n--nnnnnn" edc:cname="GMAC_TSR" edc:impl="0x13F" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="UBR" edc:desc="Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COL" edc:desc="Collision Occurred" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RLE" edc:desc="Retry Limit Exceeded" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXGO" edc:desc="Transmit Go" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050018" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="GMAC_RBQB" edc:impl="0xFFFFFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Receive Buffer Queue Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005001C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="GMAC_TBQB" edc:impl="0xFFFFFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Transmit Buffer Queue Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050020" edc:access="----------------------------nnnn" edc:cname="GMAC_RSR" edc:impl="0xF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="BNA" edc:desc="Buffer Not Available" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REC" edc:desc="Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HNO" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
