Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/edc/ATSAMV71Q21.PIC
      <edc:SFRDef edc:_addr="0x4005C050" edc:access="------------wwww------------wwww" edc:cname="PWM1_OSC" edc:impl="0xF000F" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="OSCH0" edc:desc="Output Selection Clear for PWMH output of the channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCH1" edc:desc="Output Selection Clear for PWMH output of the channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCH2" edc:desc="Output Selection Clear for PWMH output of the channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCH3" edc:desc="Output Selection Clear for PWMH output of the channel 3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSCL0" edc:desc="Output Selection Clear for PWML output of the channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCL1" edc:desc="Output Selection Clear for PWML output of the channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCL2" edc:desc="Output Selection Clear for PWML output of the channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCL3" edc:desc="Output Selection Clear for PWML output of the channel 3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C054" edc:access="------------wwww------------wwww" edc:cname="PWM1_OSSUPD" edc:impl="0xF000F" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="OSSUPH0" edc:desc="Output Selection Set for PWMH output of the channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSUPH1" edc:desc="Output Selection Set for PWMH output of the channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSUPH2" edc:desc="Output Selection Set for PWMH output of the channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSUPH3" edc:desc="Output Selection Set for PWMH output of the channel 3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSSUPL0" edc:desc="Output Selection Set for PWML output of the channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSUPL1" edc:desc="Output Selection Set for PWML output of the channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSUPL2" edc:desc="Output Selection Set for PWML output of the channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSUPL3" edc:desc="Output Selection Set for PWML output of the channel 3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C058" edc:access="------------wwww------------wwww" edc:cname="PWM1_OSCUPD" edc:impl="0xF000F" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="OSCUPH0" edc:desc="Output Selection Clear for PWMH output of the channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCUPH1" edc:desc="Output Selection Clear for PWMH output of the channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCUPH2" edc:desc="Output Selection Clear for PWMH output of the channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCUPH3" edc:desc="Output Selection Clear for PWMH output of the channel 3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSCUPL0" edc:desc="Output Selection Clear for PWML output of the channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCUPL1" edc:desc="Output Selection Clear for PWML output of the channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCUPL2" edc:desc="Output Selection Clear for PWML output of the channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCUPL3" edc:desc="Output Selection Clear for PWML output of the channel 3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C05C" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM1_FMR" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="FPOL" edc:desc="Fault Polarity" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="FMOD" edc:desc="Fault Activation Mode" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="FFIL" edc:desc="Fault Filtering" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C060" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="PWM1_FSR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="FIV" edc:desc="Fault Input Value" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="FS" edc:desc="Fault Status" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C064" edc:access="------------------------wwwwwwww" edc:cname="PWM1_FCR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="FCLR" edc:desc="Fault Clear" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C068" edc:access="------------nnnn------------nnnn" edc:cname="PWM1_FPV1" edc:impl="0xF000F" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="FPVH0" edc:desc="Fault Protection Value for PWMH output on channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FPVH1" edc:desc="Fault Protection Value for PWMH output on channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FPVH2" edc:desc="Fault Protection Value for PWMH output on channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FPVH3" edc:desc="Fault Protection Value for PWMH output on channel 3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FPVL0" edc:desc="Fault Protection Value for PWML output on channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FPVL1" edc:desc="Fault Protection Value for PWML output on channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FPVL2" edc:desc="Fault Protection Value for PWML output on channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FPVL3" edc:desc="Fault Protection Value for PWML output on channel 3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C06C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM1_FPE" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="FPE0" edc:desc="Fault Protection Enable for channel 0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="FPE1" edc:desc="Fault Protection Enable for channel 1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="FPE2" edc:desc="Fault Protection Enable for channel 2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="FPE3" edc:desc="Fault Protection Enable for channel 3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4005C070" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x4005C07C" edc:access="------------------------nnnnnnnn" edc:cname="PWM1_ELMR0" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CSEL0" edc:desc="Comparison 0 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL1" edc:desc="Comparison 1 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL2" edc:desc="Comparison 2 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL3" edc:desc="Comparison 3 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL4" edc:desc="Comparison 4 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL5" edc:desc="Comparison 5 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL6" edc:desc="Comparison 6 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL7" edc:desc="Comparison 7 Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C080" edc:access="------------------------nnnnnnnn" edc:cname="PWM1_ELMR1" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CSEL0" edc:desc="Comparison 0 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL1" edc:desc="Comparison 1 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL2" edc:desc="Comparison 2 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL3" edc:desc="Comparison 3 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL4" edc:desc="Comparison 4 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL5" edc:desc="Comparison 5 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL6" edc:desc="Comparison 6 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL7" edc:desc="Comparison 7 Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4005C084" edc:offset="0x1C"/>
      <edc:SFRDef edc:_addr="0x4005C0A0" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM1_SSPR" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="SPRD" edc:desc="Spread Spectrum Limit Value" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="SPRDM" edc:desc="Spread Spectrum Counter Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C0A4" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PWM1_SSPUP" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="SPRDUP" edc:desc="Spread Spectrum Limit Value Update" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
