Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/edc/ATSAMV71Q21.PIC
      <edc:SFRDef edc:_addr="0x4005C13C" edc:access="------------wwww----wwwwwwww---w" edc:cname="PWM_CMPPWM1_CMPMUPD" edc:impl="0xF0FF1" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CENUPD" edc:desc="Comparison x Enable Update" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTRUPD" edc:desc="Comparison x Trigger Update" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPRUPD" edc:desc="Comparison x Period Update" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRUPD" edc:desc="Comparison x Update Period Update" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4005C140" edc:offset="0xC0"/>
      <edc:SFRDef edc:_addr="0x4005C200" edc:access="------------nnnn--nnnnnn----nnnn" edc:cname="PWM_CH_NUMPWM1_CMR" edc:impl="0xF3F0F" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CPRE" edc:desc="Channel Pre-scaler" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Peripheral clock" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_2" edc:desc="Peripheral clock/2" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_4" edc:desc="Peripheral clock/4" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_8" edc:desc="Peripheral clock/8" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_16" edc:desc="Peripheral clock/16" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_32" edc:desc="Peripheral clock/32" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_64" edc:desc="Peripheral clock/64" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_128" edc:desc="Peripheral clock/128" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_256" edc:desc="Peripheral clock/256" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_512" edc:desc="Peripheral clock/512" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_1024" edc:desc="Peripheral clock/1024" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="CLKA" edc:desc="Clock A" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="CLKB" edc:desc="Clock B" edc:when="(field &amp; 0xF) == 0xC"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CALG" edc:desc="Channel Alignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPOL" edc:desc="Channel Polarity" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CES" edc:desc="Counter Event Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPDS" edc:desc="Update Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPOLI" edc:desc="Disabled Polarity Inverted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCTS" edc:desc="Timer Counter Trigger Selection" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DTE" edc:desc="Dead-Time Generator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTHI" edc:desc="Dead-Time PWMHx Output Inverted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTLI" edc:desc="Dead-Time PWMLx Output Inverted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PPM" edc:desc="Push-Pull Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C204" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM_CH_NUMPWM1_CDTY" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CDTY" edc:desc="Channel Duty-Cycle" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C208" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PWM_CH_NUMPWM1_CDTYUPD" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CDTYUPD" edc:desc="Channel Duty-Cycle Update" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C20C" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM_CH_NUMPWM1_CPRD" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CPRD" edc:desc="Channel Period" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C210" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PWM_CH_NUMPWM1_CPRDUPD" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CPRDUPD" edc:desc="Channel Period Update" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C214" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PWM_CH_NUMPWM1_CCNT" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CNT" edc:desc="Channel Counter Register" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C218" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM_CH_NUMPWM1_DT" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="DTH" edc:desc="Dead-Time Value for PWMHx Output" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DTL" edc:desc="Dead-Time Value for PWMLx Output" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C21C" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PWM_CH_NUMPWM1_DTUPD" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="DTHUPD" edc:desc="Dead-Time Value Update for PWMHx Output" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DTLUPD" edc:desc="Dead-Time Value Update for PWMLx Output" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4005C220" edc:offset="0x1E0"/>
      <edc:SFRDef edc:_addr="0x4005C400" edc:access="------------------w---w---------" edc:cname="PWM1_CMUPD0" edc:impl="0x2200" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="CPOLUP" edc:desc="Channel Polarity Update" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CPOLINVUP" edc:desc="Channel Polarity Inversion Update" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
