Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/edc/ATSAMV71Q21.PIC
      <edc:SFRDef edc:_addr="0x400E0738" edc:access="---wwwww--wwwwwwwwwwwwwww-w-wwww" edc:cname="PMC_SLPWK_DR1" edc:impl="0x1F3FFFAF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PID32" edc:desc="Peripheral 32 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID33" edc:desc="Peripheral 33 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID34" edc:desc="Peripheral 34 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID35" edc:desc="Peripheral 35 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID37" edc:desc="Peripheral 37 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID39" edc:desc="Peripheral 39 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID40" edc:desc="Peripheral 40 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID41" edc:desc="Peripheral 41 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID42" edc:desc="Peripheral 42 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID43" edc:desc="Peripheral 43 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID44" edc:desc="Peripheral 44 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID45" edc:desc="Peripheral 45 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID46" edc:desc="Peripheral 46 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID47" edc:desc="Peripheral 47 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID48" edc:desc="Peripheral 48 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID49" edc:desc="Peripheral 49 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID50" edc:desc="Peripheral 50 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID51" edc:desc="Peripheral 51 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID52" edc:desc="Peripheral 52 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID53" edc:desc="Peripheral 53 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID56" edc:desc="Peripheral 56 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID57" edc:desc="Peripheral 57 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID58" edc:desc="Peripheral 58 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID59" edc:desc="Peripheral 59 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID60" edc:desc="Peripheral 60 SleepWalking Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E073C" edc:access="---rrrrr--rrrrrrrrrrrrrrr-r-rrrr" edc:cname="PMC_SLPWK_SR1" edc:impl="0x1F3FFFAF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PID32" edc:desc="Peripheral 32 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID33" edc:desc="Peripheral 33 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID34" edc:desc="Peripheral 34 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID35" edc:desc="Peripheral 35 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID37" edc:desc="Peripheral 37 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID39" edc:desc="Peripheral 39 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID40" edc:desc="Peripheral 40 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID41" edc:desc="Peripheral 41 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID42" edc:desc="Peripheral 42 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID43" edc:desc="Peripheral 43 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID44" edc:desc="Peripheral 44 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID45" edc:desc="Peripheral 45 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID46" edc:desc="Peripheral 46 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID47" edc:desc="Peripheral 47 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID48" edc:desc="Peripheral 48 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID49" edc:desc="Peripheral 49 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID50" edc:desc="Peripheral 50 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID51" edc:desc="Peripheral 51 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID52" edc:desc="Peripheral 52 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID53" edc:desc="Peripheral 53 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID56" edc:desc="Peripheral 56 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID57" edc:desc="Peripheral 57 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID58" edc:desc="Peripheral 58 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID59" edc:desc="Peripheral 59 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID60" edc:desc="Peripheral 60 SleepWalking Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0740" edc:access="---rrrrr--rrrrrrrrrrrrrrr-r-rrrr" edc:cname="PMC_SLPWK_ASR1" edc:impl="0x1F3FFFAF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PID32" edc:desc="Peripheral 32 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID33" edc:desc="Peripheral 33 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID34" edc:desc="Peripheral 34 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID35" edc:desc="Peripheral 35 Activity Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID37" edc:desc="Peripheral 37 Activity Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID39" edc:desc="Peripheral 39 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID40" edc:desc="Peripheral 40 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID41" edc:desc="Peripheral 41 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID42" edc:desc="Peripheral 42 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID43" edc:desc="Peripheral 43 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID44" edc:desc="Peripheral 44 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID45" edc:desc="Peripheral 45 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID46" edc:desc="Peripheral 46 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID47" edc:desc="Peripheral 47 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID48" edc:desc="Peripheral 48 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID49" edc:desc="Peripheral 49 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID50" edc:desc="Peripheral 50 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID51" edc:desc="Peripheral 51 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID52" edc:desc="Peripheral 52 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID53" edc:desc="Peripheral 53 Activity Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID56" edc:desc="Peripheral 56 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID57" edc:desc="Peripheral 57 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID58" edc:desc="Peripheral 58 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID59" edc:desc="Peripheral 59 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID60" edc:desc="Peripheral 60 Activity Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0744" edc:access="-------------------------------r" edc:cname="PMC_SLPWK_AIPR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="AIP" edc:desc="Activity In Progress" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E0748" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x400E0758" edc:access="----------------------nnnnnnnnnn" edc:cname="PMC_APLLACR" edc:impl="0x3FF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="DCOFLTSEL" edc:desc="DCO Filter Selection" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="FLTSEL" edc:desc="PLL Filter Selection" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="BIAS" edc:desc="Bias Voltage Selection" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E075C" edc:access="nnnnnnnn----------------nnnnnnnn" edc:cname="PMC_WMST" edc:impl="0xFF0000FF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="WMST" edc:desc="Wait Mode Startup Time" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="Write Access Password" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation.Always reads as 0." edc:when="(field &amp; 0xFF) == 0x5A"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E0760" edc:offset="0xA0"/>
      <edc:SFRDef edc:_addr="0x400E0800" edc:access="----------------w--w---wwwwwww--" edc:cname="UART0_CR" edc:impl="0x91FC" edc:nzwidth="0x20" ltx:memberofperipheral="UART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RSTRX" edc:desc="Reset Receiver" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTTX" edc:desc="Reset Transmitter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="Receiver Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXDIS" edc:desc="Receiver Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="Transmitter Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXDIS" edc:desc="Transmitter Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTSTA" edc:desc="Reset Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="REQCLR" edc:desc="Request Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DBGE" edc:desc="Debug Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0804" edc:access="----------------nn-nnnn----n----" edc:cname="UART0_MR" edc:impl="0xDE10" edc:nzwidth="0x20" ltx:memberofperipheral="UART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART0">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="FILTER" edc:desc="Receiver Digital Filter" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="UART does not filter the receive line." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="UART filters the receive line using a three-sample filter (16x-bit clock) (2 over 3 majority)." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PAR" edc:desc="Parity Type" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="EVEN" edc:desc="Even Parity" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ODD" edc:desc="Odd Parity" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SPACE" edc:desc="Space: parity forced to 0" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MARK" edc:desc="Mark: parity forced to 1" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No parity" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BRSRCCK" edc:desc="Baud Rate Source Clock" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="PERIPH_CLK" edc:desc="The baud rate is driven by the peripheral clock" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PMC_PCK" edc:desc="The baud rate is driven by a PMC-programmable clock PCK (see section Power Management Controller (PMC))." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CHMODE" edc:desc="Channel Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AUTOMATIC" edc:desc="Automatic echo" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="LOCAL_LOOPBACK" edc:desc="Local loopback" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="REMOTE_LOOPBACK" edc:desc="Remote loopback" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0808" edc:access="----------------w-----w-www---ww" edc:cname="UART0_IER" edc:impl="0x82E3" edc:nzwidth="0x20" ltx:memberofperipheral="UART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART0">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Enable RXRDY Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Enable TXRDY Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Enable Overrun Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:desc="Enable Framing Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:desc="Enable Parity Error Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Enable TXEMPTY Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:desc="Enable Comparison Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
