Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/edc/ATSAMV71Q21.PIC
      <edc:SFRDef edc:_addr="0x400E0E38" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PIOA_ODSR" edc:nzwidth="0x20" ltx:memberofperipheral="PIOA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOA">
            <edc:SFRFieldDef edc:cname="P0" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P1" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P2" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P3" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P4" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P5" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P6" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P7" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P8" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P9" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P10" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P11" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P12" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P13" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P14" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P15" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P16" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P17" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P18" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P19" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P20" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P21" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P22" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P23" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P24" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P25" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P26" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P27" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P28" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P29" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P30" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P31" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0E3C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PIOA_PDSR" edc:nzwidth="0x20" ltx:memberofperipheral="PIOA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOA">
            <edc:SFRFieldDef edc:cname="P0" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P1" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P2" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P3" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P4" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P5" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P6" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P7" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P8" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P9" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P10" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P11" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P12" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P13" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P14" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P15" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P16" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P17" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P18" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P19" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P20" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P21" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P22" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P23" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P24" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P25" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P26" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P27" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P28" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P29" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P30" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P31" edc:desc="Output Data Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0E40" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PIOA_IER" edc:nzwidth="0x20" ltx:memberofperipheral="PIOA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOA">
            <edc:SFRFieldDef edc:cname="P0" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P1" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P2" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P3" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P4" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P5" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P6" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P7" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P8" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P9" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P10" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P11" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P12" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P13" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P14" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P15" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P16" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P17" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P18" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P19" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P20" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P21" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P22" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P23" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P24" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P25" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P26" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P27" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P28" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P29" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P30" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P31" edc:desc="Input Change Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0E44" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PIOA_IDR" edc:nzwidth="0x20" ltx:memberofperipheral="PIOA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOA">
            <edc:SFRFieldDef edc:cname="P0" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P1" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P2" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P3" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P4" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P5" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P6" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P7" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P8" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P9" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P10" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P11" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P12" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P13" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P14" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P15" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P16" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P17" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P18" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P19" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P20" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P21" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P22" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P23" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P24" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P25" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P26" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P27" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P28" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P29" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P30" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P31" edc:desc="Input Change Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
